{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "995457e8",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "pd.set_option('display.max_columns', 500)\n",
    "pd.set_option('max_colwidth', None)\n",
    "pd.set_option('display.max_rows', None)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "457de615",
   "metadata": {},
   "source": [
    "## Read dataset"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "1733b799",
   "metadata": {},
   "outputs": [],
   "source": [
    "hpsc_county = pd.read_csv(\"COVID-19_HPSC_County_Statistics_Historic_Data.csv\")\n",
    "hse_vaccine = pd.read_csv(\"COVID-19_HSE_Weekly_Vaccination_Figures.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2d6f4771",
   "metadata": {},
   "source": [
    "## Task 3 \n",
    "\n",
    "### Create Knowledge Graphs from county statistics"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "a6ffc53c",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Task 3 - Write a Python script using RDFlib (or similar) to transform the data into RDF.\n",
    "# consider http://ex.org/ as URI prefix\n",
    "\n",
    "from rdflib import Graph, plugin\n",
    "from SPARQLWrapper import SPARQLWrapper\n",
    "from rdflib.serializer import Serializer\n",
    "from rdflib import URIRef, BNode, Literal, XSD\n",
    "from rdflib.namespace import RDF, FOAF, ORG\n",
    "from datetime import datetime\n",
    "\n",
    "task3_rdf = Graph()\n",
    "\n",
    "def addCounty(task3_rdf, subject, county_name):\n",
    "    #add county name\n",
    "    hasCountyName = URIRef(\"http://ex.org/county/hasCountyName\")\n",
    "    county_name = Literal(county_name)\n",
    "    task3_rdf.add((subject, hasCountyName, county_name))\n",
    "    \n",
    "    return task3_rdf\n",
    "\n",
    "def addCountyPop(task3_rdf, subject, population):\n",
    "    #add population\n",
    "    hasPopulation = URIRef(\"http://ex.org/county/hasPopulation\")\n",
    "    population = Literal(population,datatype=XSD.integer)\n",
    "    task3_rdf.add((subject, hasPopulation, population))\n",
    "    \n",
    "    return task3_rdf\n",
    "\n",
    "def addCountyLocation(task3_rdf, subject, IGEasting, IGNorthing, Lat, Long):\n",
    "    #add location (IGEasting / IGNorthing / Lat / Long)\n",
    "    locateAtIGEasting = URIRef(\"http://ex.org/county/locateAtIGEasting\")\n",
    "    IGEasting = Literal(IGEasting,datatype=XSD.integer)\n",
    "    task3_rdf.add((subject, locateAtIGEasting, IGEasting))\n",
    "    \n",
    "    locateAtIGNorthing = URIRef(\"http://ex.org/county/locateAtIGNorthing\")\n",
    "    IGNorthing = Literal(IGNorthing,datatype=XSD.integer)\n",
    "    task3_rdf.add((subject, locateAtIGNorthing, IGNorthing))\n",
    "    \n",
    "    locateAtLat = URIRef(\"http://ex.org/county/locateAtLat\")\n",
    "    Lat = Literal(Lat,datatype=XSD.float)\n",
    "    task3_rdf.add((subject, locateAtLat, Lat))\n",
    "    \n",
    "    locateAtLong = URIRef(\"http://ex.org/county/locateAtLong\")\n",
    "    Long = Literal(Long,datatype=XSD.float)\n",
    "    task3_rdf.add((subject, locateAtLong, Long))\n",
    "\n",
    "    return task3_rdf\n",
    "\n",
    "def addCountyShape(task3_rdf, subject, SHAPE_Length, SHAPE_Area):\n",
    "    #add shape (SHAPE_Length / SHAPE_Area)\n",
    "    hasShapeLength = URIRef(\"http://ex.org/county/hasShapeLength\")\n",
    "    SHAPE_Length = Literal(SHAPE_Length,datatype=XSD.float)\n",
    "    task3_rdf.add((subject, hasShapeLength, SHAPE_Length))\n",
    "    \n",
    "    hasShapeArea = URIRef(\"http://ex.org/county/hasShapeArea\")\n",
    "    SHAPE_Area = Literal(SHAPE_Area,datatype=XSD.float)\n",
    "    task3_rdf.add((subject, hasShapeArea, SHAPE_Area))\n",
    "\n",
    "    return task3_rdf\n",
    "\n",
    "def addCountyUGI(task3_rdf, subject, UGI):\n",
    "    #add ugi\n",
    "    representsAs = URIRef(\"http://ex.org/county/representsAs\")\n",
    "    UGI = Literal(UGI,datatype=XSD.anyURI)\n",
    "    task3_rdf.add((subject, representsAs, UGI))\n",
    "    \n",
    "    return task3_rdf\n",
    "\n",
    "def addCountyCovidRecord(task3_rdf, subject, object_):\n",
    "    #add covid record (Class)\n",
    "    hasCovidRecord = URIRef(\"http://ex.org/county/hasCovidRecord\")\n",
    "    task3_rdf.add((subject, hasCovidRecord, object_))\n",
    "    \n",
    "    return task3_rdf\n",
    "\n",
    "def addCovidRecordStats(task3_rdf, subject, ConfirmedCovidCases, PopulationProportionCovidCases, ConfirmedCovidDeaths, ConfirmedCovidRecovered):\n",
    "    #add covid stats to covid record\n",
    "    hasConfirmedCovidCases = URIRef(\"http://ex.org/covidRecord/hasCovidRecord\")\n",
    "    ConfirmedCovidCases = Literal(ConfirmedCovidCases,datatype=XSD.integer)\n",
    "    task3_rdf.add((covidRecord, hasConfirmedCovidCases, ConfirmedCovidCases))\n",
    "    \n",
    "    hasPopulationProportionCovidCases = URIRef(\"http://ex.org/covidRecord/hasPopulationProportionCovidCases\")\n",
    "    PopulationProportionCovidCases = Literal(PopulationProportionCovidCases,datatype=XSD.float)\n",
    "    task3_rdf.add((covidRecord, hasPopulationProportionCovidCases, PopulationProportionCovidCases))\n",
    "    \n",
    "    hasConfirmedCovidDeaths = URIRef(\"http://ex.org/covidRecord/hasConfirmedCovidDeaths\")\n",
    "    ConfirmedCovidDeaths = Literal(ConfirmedCovidDeaths,datatype=XSD.float)\n",
    "    task3_rdf.add((covidRecord, hasConfirmedCovidDeaths, ConfirmedCovidDeaths))\n",
    "    \n",
    "    hasConfirmedCovidRecovered = URIRef(\"http://ex.org/covidRecord/hasConfirmedCovidRecovered\")\n",
    "    ConfirmedCovidRecovered = Literal(ConfirmedCovidRecovered,datatype=XSD.float)\n",
    "    task3_rdf.add((covidRecord, hasConfirmedCovidRecovered, ConfirmedCovidRecovered))\n",
    "    \n",
    "    return task3_rdf\n",
    "\n",
    "def addCovidRecordTimestamp(task3_rdf, subject, TimeStamp): \n",
    "    #add timestamp to covid record\n",
    "    recordOn = URIRef(\"http://ex.org/covidRecord/recordOn\")\n",
    "    TimeStamp = Literal(datetime.strptime(TimeStamp, '%Y/%m/%d 00:00:00+00').date(),datatype=XSD.date)\n",
    "    task3_rdf.add((covidRecord, recordOn, TimeStamp))\n",
    "    \n",
    "    return task3_rdf\n",
    "    \n",
    "    \n",
    "# loop through each line of dataset,\n",
    "# define subject, predicate and object then add them to graph\n",
    "for index, row in hpsc_county.iterrows():\n",
    "    county = URIRef(\"http://ex.org/county/\"+row['CountyName'])\n",
    "\n",
    "    task3_rdf = addCounty(task3_rdf, county, row['CountyName'])\n",
    "    task3_rdf = addCountyPop(task3_rdf, county, row['PopulationCensus16'])\n",
    "    task3_rdf = addCountyLocation(task3_rdf, county, row['IGEasting'], row['IGNorthing'], row['Lat'], row['Long'])\n",
    "    task3_rdf = addCountyShape(task3_rdf, county, row['SHAPE_Length'], row['SHAPE_Area'])\n",
    "    task3_rdf = addCountyUGI(task3_rdf, county, row['UGI'])\n",
    "    \n",
    "    covidRecord = URIRef(\"http://ex.org/covidRecord/\"+str(row['OBJECTID']))\n",
    "    task3_rdf = addCountyCovidRecord(task3_rdf, county, covidRecord)\n",
    "    task3_rdf = addCovidRecordStats(task3_rdf, covidRecord, \n",
    "                        row['ConfirmedCovidCases'], \n",
    "                        row['PopulationProportionCovidCases'],\n",
    "                        row['ConfirmedCovidDeaths'],\n",
    "                        row['ConfirmedCovidRecovered'])\n",
    "    task3_rdf = addCovidRecordTimestamp(task3_rdf, covidRecord, row['TimeStamp'])\n",
    "    \n",
    "#     if index == 1:\n",
    "#         break\n",
    "    \n"
   ]
  },
  {
   "cell_type": "raw",
   "id": "6f58b2c4",
   "metadata": {},
   "source": [
    "#### Example from Task 3\n",
    "\n",
    "@prefix ns1: <http://ex.org/county/> .\n",
    "@prefix ns2: <http://ex.org/covidRecord/> .\n",
    "@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\n",
    "\n",
    "ns1:Carlow ns1:hasCountyName \"Carlow\" ;\n",
    "    ns1:hasCovidRecord ns2:1 ;\n",
    "    ns1:hasPopulation 56932 ;\n",
    "    ns1:hasShapeArea \"0.11886319621816\"^^xsd:float ;\n",
    "    ns1:hasShapeLength \"2.2841588558823\"^^xsd:float ;\n",
    "    ns1:locateAtIGEasting 278661 ;\n",
    "    ns1:locateAtIGNorthing 163444 ;\n",
    "    ns1:locateAtLat \"52.7168\"^^xsd:float ;\n",
    "    ns1:locateAtLong \"-6.8367\"^^xsd:float ;\n",
    "    ns1:representsAs \"http://data.geohive.ie/resource/county/2ae19629-143d-13a3-e055-000000000001\"^^xsd:anyURI .\n",
    "\n",
    "ns1:Cavan ns1:hasCountyName \"Cavan\" ;\n",
    "    ns1:hasCovidRecord ns2:2 ;\n",
    "    ns1:hasPopulation 76176 ;\n",
    "    ns1:hasShapeArea \"0.264466477248625\"^^xsd:float ;\n",
    "    ns1:hasShapeLength \"3.7674112393481\"^^xsd:float ;\n",
    "    ns1:locateAtIGEasting 246380 ;\n",
    "    ns1:locateAtIGNorthing 304501 ;\n",
    "    ns1:locateAtLat \"53.9878\"^^xsd:float ;\n",
    "    ns1:locateAtLong \"-7.2937\"^^xsd:float ;\n",
    "    ns1:representsAs \"http://data.geohive.ie/resource/county/2ae19629-1448-13a3-e055-000000000001\"^^xsd:anyURI .\n",
    "\n",
    "ns2:1 ns2:hasConfirmedCovidDeaths \"NaN\"^^xsd:float ;\n",
    "    ns2:hasConfirmedCovidRecovered \"NaN\"^^xsd:float ;\n",
    "    ns2:hasCovidRecord 0 ;\n",
    "    ns2:hasPopulationProportionCovidCases \"NaN\"^^xsd:float ;\n",
    "    ns2:recordOn \"2020-02-27\"^^xsd:date .\n",
    "\n",
    "ns2:2 ns2:hasConfirmedCovidDeaths \"NaN\"^^xsd:float ;\n",
    "    ns2:hasConfirmedCovidRecovered \"NaN\"^^xsd:float ;\n",
    "    ns2:hasCovidRecord 0 ;\n",
    "    ns2:hasPopulationProportionCovidCases \"NaN\"^^xsd:float ;\n",
    "    ns2:recordOn \"2020-02-27\"^^xsd:date ."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "68d9f84c",
   "metadata": {},
   "source": [
    "## Task 4 \n",
    "\n",
    "### Query from Wikidata to generate connection between Task 3 and Task 4\n",
    "\n",
    "County and City of the vaccination centre is obtained from Wikidata. Then they are added to the vaccine dataset as new columns."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "b45b19a3",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/opt/homebrew/Caskroom/miniforge/base/lib/python3.9/site-packages/requests/__init__.py:102: RequestsDependencyWarning: urllib3 (1.26.8) or chardet (5.0.0)/charset_normalizer (2.0.11) doesn't match a supported version!\n",
      "  warnings.warn(\"urllib3 ({}) or chardet ({})/charset_normalizer ({}) doesn't match a supported \"\n"
     ]
    }
   ],
   "source": [
    "#Task 4 - Write a Python script using RDFlib (or similar) to transform the data into RDF.\n",
    "#connect this data with the county statistics with location from wikidata\n",
    "\n",
    "from qwikidata.sparql  import return_sparql_query_results\n",
    "import numpy as np\n",
    "\n",
    "unique_xypoints = set(zip(list(hse_vaccine['X']), list(hse_vaccine['Y'])))\n",
    "\n",
    "wikidata_results = {}\n",
    "\n",
    "for xy in unique_xypoints:\n",
    "    wikidata_query = '''\n",
    "        SELECT ?place ?location ?countyLabel ?distance ?placeLabel WHERE {\n",
    "           ?place wdt:P7959 ?county .\n",
    "            SERVICE wikibase:around { \n",
    "              ?place wdt:P625 ?location .\n",
    "              bd:serviceParam wikibase:center \"Point('''+f'''{xy[0]} {xy[1]}'''+''')\"^^geo:wktLiteral . \n",
    "              bd:serviceParam wikibase:radius \"0.5\" . \n",
    "              bd:serviceParam wikibase:distance ?distance .\n",
    "\n",
    "            } \n",
    "            SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
    "\n",
    "        } ORDER BY ?distance LIMIT 1\n",
    "    '''\n",
    "\n",
    "    xypoints_results = return_sparql_query_results(wikidata_query)\n",
    "\n",
    "    for row in xypoints_results['results']['bindings']:\n",
    "        wikidata_results[xy] = {}\n",
    "        wikidata_results[xy]['County'] = row['countyLabel']['value'].replace(\"County \", \"\")\n",
    "        wikidata_results[xy]['City'] = row['placeLabel']['value']\n",
    "\n",
    "wikidata_results\n",
    "\n",
    "# add county and city column to HSE dataset, add triples to RDF with county as class, city as another class,\n",
    "# vaccination info is properties under city\n",
    "hse_vaccine['XY'] = list(zip(list(hse_vaccine['X']), list(hse_vaccine['Y'])))\n",
    "\n",
    "county = {k: v['County'] for k,v in wikidata_results.items()}\n",
    "city = {k: v['City'] for k,v in wikidata_results.items()}\n",
    "\n",
    "county_city = {v['County']: v['City'] for k,v in wikidata_results.items()}\n",
    "\n",
    "    \n",
    "hse_vaccine['CountyName'] = hse_vaccine['XY'].map(county)\n",
    "hse_vaccine['CityName'] = hse_vaccine['XY'].map(city)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0bcd36d4",
   "metadata": {},
   "source": [
    "\n",
    "### Create Knowledge Graphs from Vaccine dataset"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "1da67b8b",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Task 4 - Write a Python script using RDFlib (or similar) to transform the data into RDF.\n",
    "# consider http://ex.org/ as URI prefix\n",
    "\n",
    "from rdflib import Graph, plugin\n",
    "from SPARQLWrapper import SPARQLWrapper\n",
    "from rdflib.serializer import Serializer\n",
    "from rdflib import URIRef, BNode, Literal, XSD\n",
    "from rdflib.namespace import RDF, FOAF, ORG\n",
    "from datetime import datetime\n",
    "\n",
    "task4_rdf = Graph()\n",
    "\n",
    "def addCity(rdf, subject, city_name):\n",
    "    #add city and city name\n",
    "    hasCity = URIRef(\"http://ex.org/county/hasCity\")\n",
    "    city = URIRef(f\"http://ex.org/city/{city_name}\")\n",
    "    rdf.add((subject, hasCity, city))\n",
    "    \n",
    "    hasCityName = URIRef(\"http://ex.org/city/hasCityName\")\n",
    "    city_name = Literal(city_name)\n",
    "    rdf.add((city, hasCityName, city_name))\n",
    "    \n",
    "    return rdf\n",
    "    \n",
    "def addVaccinationCentre(task3_rdf, subject, vaccinationCentre):\n",
    "    #add vaccinationCentre\n",
    "    hasVaccinationCentre = URIRef(\"http://ex.org/city/hasVaccinationCentre\")\n",
    "    task3_rdf.add((subject, hasVaccinationCentre, vaccinationCentre))\n",
    "    \n",
    "    return task3_rdf\n",
    "\n",
    "def addVCLocation(task3_rdf, subject, X, Y):\n",
    "    #add vc location\n",
    "    hasXPoint = URIRef(\"http://ex.org/vaccinationCentre/hasXPoint\")\n",
    "    X = Literal(X,datatype=XSD.float)\n",
    "    task3_rdf.add((subject, hasXPoint, X))\n",
    "    \n",
    "    hasYPoint = URIRef(\"http://ex.org/vaccinationCentre/hasYPoint\")\n",
    "    Y = Literal(Y,datatype=XSD.float)\n",
    "    task3_rdf.add((subject, hasYPoint, Y))\n",
    "    \n",
    "    return task3_rdf\n",
    "\n",
    "def addVaccinationRecord(rdf, subject, object_):\n",
    "    #add vcRecord\n",
    "    hasVaccinationRecord = URIRef(\"http://ex.org/vaccinationCentre/hasVaccinationRecord\")\n",
    "    rdf.add((subject, hasVaccinationRecord, object_))\n",
    "    \n",
    "    return rdf\n",
    "\n",
    "def addExtractDate(task3_rdf, subject, TimeStamp):\n",
    "    #add date to vaccination record\n",
    "    extractOn = URIRef(\"http://ex.org/vaccinationRecord/extractOn\")\n",
    "    TimeStamp = Literal(datetime.strptime(TimeStamp, '%Y/%m/%d').date(),datatype=XSD.date)\n",
    "    task3_rdf.add((subject, extractOn, TimeStamp))\n",
    "    \n",
    "    return task3_rdf\n",
    "\n",
    "def addWeek(task3_rdf, subject, week):\n",
    "    #add week\n",
    "    recordOn = URIRef(\"http://ex.org/vaccinationRecord/recordOn\")\n",
    "    week = Literal(week)\n",
    "    task3_rdf.add((subject, recordOn, week))\n",
    "\n",
    "    return task3_rdf\n",
    "\n",
    "def addTotalweeklyVaccines(task3_rdf, subject, TotalWeeklyVaccines):\n",
    "    #add TotalWeeklyVaccines\n",
    "    hasTotalWeeklyVaccines = URIRef(\"http://ex.org/vaccinationRecord/hasTotalWeeklyVaccines\")\n",
    "    TotalWeeklyVaccines = Literal(TotalWeeklyVaccines,datatype=XSD.integer)\n",
    "    task3_rdf.add((subject, hasTotalWeeklyVaccines, TotalWeeklyVaccines))\n",
    "    \n",
    "    return task3_rdf\n",
    "\n",
    "def addGenderVaccination(task3_rdf, subject, id_, male, female, na):\n",
    "    #add female, male, na weekly vaccinated value\n",
    "    hasGender = URIRef(\"http://ex.org/vaccinationRecord/hasGender\")\n",
    "    male_gender = URIRef(f\"http://ex.org/{id_}_Male\")\n",
    "    task3_rdf.add((subject, hasGender, male_gender))\n",
    "    female_gender = URIRef(f\"http://ex.org/{id_}_Female\")\n",
    "    task3_rdf.add((subject, hasGender, female_gender))\n",
    "    na_gender = URIRef(f\"http://ex.org/{id_}_NA\")\n",
    "    task3_rdf.add((subject, hasGender, na_gender))\n",
    "    \n",
    "    hasName = URIRef(\"http://ex.org/gender/hasName\")\n",
    "    gender = Literal(\"Male\")\n",
    "    task3_rdf.add((male_gender, hasName, gender))\n",
    "    gender = Literal(\"Female\")\n",
    "    task3_rdf.add((female_gender, hasName, gender))\n",
    "    gender = Literal(\"NA\")\n",
    "    task3_rdf.add((na_gender, hasName, gender))\n",
    "    \n",
    "    hasValue = URIRef(\"http://ex.org/vaccinationRecord/hasValue\")\n",
    "    male = Literal(male,datatype=XSD.integer)\n",
    "    task3_rdf.add((male_gender, hasValue, male))\n",
    "#     hasFemaleValue = URIRef(\"http://ex.org/vaccinationRecord/hasFemaleValue\")\n",
    "    female = Literal(female,datatype=XSD.integer)\n",
    "    task3_rdf.add((female_gender, hasValue, female))\n",
    "#     hasNAValue = URIRef(\"http://ex.org/vaccinationRecord/hasNAValue\")\n",
    "    na = Literal(na,datatype=XSD.integer)\n",
    "    task3_rdf.add((na_gender, hasValue, na))\n",
    "    \n",
    "    return task3_rdf\n",
    "\n",
    "def addVaccineTypeVaccination(task3_rdf, subject, id_, moderna, pfizer, janssen, az):\n",
    "    #add vaccines type to vaccination record\n",
    "    hasVaccine = URIRef(\"http://ex.org/vaccinationRecord/hasVaccine\")\n",
    "    moderna_vaccine = URIRef(f\"http://ex.org/{id_}_Moderna\")\n",
    "    task3_rdf.add((subject, hasVaccine, moderna_vaccine))\n",
    "    pfizer_vaccine = URIRef(f\"http://ex.org/{id_}_Pfizer\")\n",
    "    task3_rdf.add((subject, hasVaccine, pfizer_vaccine))\n",
    "    janssen_vaccine = URIRef(f\"http://ex.org/{id_}_Janssen\")\n",
    "    task3_rdf.add((subject, hasVaccine, janssen_vaccine))\n",
    "    az_vaccine = URIRef(f\"http://ex.org/{id_}_AstraZeneca\")\n",
    "    task3_rdf.add((subject, hasVaccine, az_vaccine))\n",
    "    \n",
    "    hasName = URIRef(\"http://ex.org/vaccine/hasName\")\n",
    "    vaccine = Literal(\"Moderna\")\n",
    "    task3_rdf.add((moderna_vaccine, hasName, vaccine))\n",
    "    vaccine = Literal(\"Pfizer\")\n",
    "    task3_rdf.add((pfizer_vaccine, hasName, vaccine))\n",
    "    vaccine = Literal(\"Janssen\")\n",
    "    task3_rdf.add((janssen_vaccine, hasName, vaccine))\n",
    "    vaccine = Literal(\"AstraZeneca\")\n",
    "    task3_rdf.add((az_vaccine, hasName, vaccine))\n",
    "    \n",
    "    #add weekly value of each vaccines type to vaccination type\n",
    "    hasValue = URIRef(\"http://ex.org/vaccinationRecord/hasValue\")\n",
    "    moderna = Literal(moderna,datatype=XSD.integer)\n",
    "    task3_rdf.add((moderna_vaccine, hasValue, moderna))\n",
    "    pfizer = Literal(pfizer,datatype=XSD.integer)\n",
    "    task3_rdf.add((pfizer_vaccine, hasValue, pfizer))\n",
    "    janssen = Literal(janssen,datatype=XSD.integer)\n",
    "    task3_rdf.add((janssen_vaccine, hasValue, janssen))\n",
    "    az = Literal(az,datatype=XSD.integer)\n",
    "    task3_rdf.add((az_vaccine, hasValue, az))\n",
    "    \n",
    "    return task3_rdf\n",
    "\n",
    "def addAgeGroupVaccination(task3_rdf, subject, id_, value, column, agegroup): \n",
    "    #add age group to vaccination record\n",
    "    hasAgeGroup = URIRef(f\"http://ex.org/vaccinationRecord/hasAgeGroup\")\n",
    "    ageGroup = URIRef(f\"http://ex.org/{id_}_{agegroup.replace('_', '')}\")\n",
    "    task3_rdf.add((subject, hasAgeGroup, ageGroup))\n",
    "    \n",
    "#     status = 'Fully'\n",
    "#     if \"Par\" in column: status = 'Partially'\n",
    "#     hasStatus = URIRef(f\"http://ex.org/hasVaccinationStatus\")\n",
    "#     vaccinationStatus = URIRef(f\"http://ex.org/{status}\")\n",
    "#     task3_rdf.add((subject, hasStatus, vaccinationStatus))\n",
    "    \n",
    "    #add age group value\n",
    "    hasValue = URIRef(f\"http://ex.org/vaccinationRecord/has{column.replace('_', '')}Value\")\n",
    "    if 'Partial_' in column:\n",
    "        value = Literal(value,datatype=XSD.integer)\n",
    "    else:\n",
    "        value = Literal(value,datatype=XSD.float)\n",
    "    task3_rdf.add((ageGroup, hasValue, value))\n",
    "    \n",
    "    return task3_rdf\n",
    "    \n",
    "    \n",
    "# loop through each line of dataset,\n",
    "# define subject, predicate and object then add them to graph\n",
    "for k, v in county_city.items():\n",
    "    county = URIRef(\"http://ex.org/county/\"+k)\n",
    "    task4_rdf = addCity(task4_rdf, county, v)\n",
    "    \n",
    "AgeGroup = ['0to9', '10to19', '20to29', '30to39', '40to49', '50to59', \n",
    "           '60to69', '70to79', '80_', 'NA']\n",
    "ColumnName = ['Partial_', 'ParCum_', 'ParPer_',\n",
    "             'Fully_', 'FullyCum_', 'FullyPer_']\n",
    "withAge80_ = ['Partial_', 'Fully_']\n",
    "for index, row in hse_vaccine.iterrows():    \n",
    "    city = URIRef(\"http://ex.org/city/\"+row['CityName'])\n",
    "    \n",
    "    vaccinationCentre = URIRef(\"http://ex.org/vaccinationCentre/\"+str(row['X'])+\"_\"+str(row['Y']))\n",
    "    task4_rdf = addVaccinationCentre(task4_rdf, city, vaccinationCentre)\n",
    "    task4_rdf = addVCLocation(task4_rdf, vaccinationCentre, row['X'], row['Y'])\n",
    "    \n",
    "    vaccinationRecord = URIRef(\"http://ex.org/vaccinationRecord/\"+str(row['ObjectId']))\n",
    "    \n",
    "    task4_rdf = addVaccinationRecord(task4_rdf, vaccinationCentre, vaccinationRecord)\n",
    "    task4_rdf = addExtractDate(task4_rdf, vaccinationRecord, row['ExtractDate'])\n",
    "    task4_rdf = addWeek(task4_rdf, vaccinationRecord, row['Week'])\n",
    "    task4_rdf = addTotalweeklyVaccines(task4_rdf, vaccinationRecord, row['TotalweeklyVaccines'])\n",
    "    \n",
    "    task4_rdf = addGenderVaccination(task4_rdf, vaccinationRecord, row['ObjectId'],\n",
    "                                     row['Male'], row['Female'], row['NA'])\n",
    "    task4_rdf = addVaccineTypeVaccination(task4_rdf, vaccinationRecord, row['ObjectId'],\n",
    "                                          row['Moderna'], row['Pfizer'], row['Janssen'], row['AstraZeneca'])\n",
    "    for agegroup in AgeGroup:\n",
    "        for column in ColumnName:\n",
    "            if (agegroup == '80_' and column not in withAge80_) or (agegroup == 'NA'):\n",
    "                task4_rdf = addAgeGroupVaccination(task4_rdf, vaccinationRecord, row['ObjectId'], row[f'{column}{agegroup}'], column, agegroup)\n",
    "            else:\n",
    "                task4_rdf = addAgeGroupVaccination(task4_rdf, vaccinationRecord, row['ObjectId'], row[f'{column}Age{agegroup}'], column, agegroup)\n",
    "    \n",
    "#     break\n",
    "#     if index == 1:\n",
    "#         break\n",
    "    "
   ]
  },
  {
   "cell_type": "raw",
   "id": "d0741ad6",
   "metadata": {},
   "source": [
    "# print(task4_rdf.serialize(format=\"turtle\"))\n",
    "\n",
    "#### Example from Task 4 \n",
    "\n",
    "@prefix ns1: <http://ex.org/vaccinationRecord/> .\n",
    "@prefix ns2: <http://ex.org/gender/> .\n",
    "@prefix ns3: <http://ex.org/vaccine/> .\n",
    "@prefix ns4: <http://ex.org/vaccinationCentre/> .\n",
    "@prefix ns5: <http://ex.org/city/> .\n",
    "@prefix ns6: <http://ex.org/county/> .\n",
    "@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\n",
    "\n",
    "ns6:Offaly ns6:hasCity ns5:Pollagh .\n",
    "\n",
    "<http://ex.org/1_0to9> ns1:hasFullyCumValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"1\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"2.08745170158625e-06\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 1 .\n",
    "\n",
    "<http://ex.org/1_10to19> ns1:hasFullyCumValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"3\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"5.42764407681202e-06\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 3 .\n",
    "\n",
    "<http://ex.org/1_20to29> ns1:hasFullyCumValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"750\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"0.0012127739049864\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 750 .\n",
    "\n",
    "<http://ex.org/1_30to39> ns1:hasFullyCumValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"1113\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"0.0016186807097762\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 1113 .\n",
    "\n",
    "<http://ex.org/1_40to49> ns1:hasFullyCumValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"1006\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"0.0012829014486839\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 1006 .\n",
    "\n",
    "<http://ex.org/1_50to59> ns1:hasFullyCumValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"794\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"0.0012499724502293\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 794 .\n",
    "\n",
    "<http://ex.org/1_60to69> ns1:hasFullyCumValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"299\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"0.0005884378843788\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 299 .\n",
    "\n",
    "<http://ex.org/1_70to79> ns1:hasFullyCumValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"23\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"6.57310001686143e-05\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 23 .\n",
    "\n",
    "<http://ex.org/1_80> ns1:hasFullyCumValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"21\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"0.0001145562853215\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 21 .\n",
    "\n",
    "<http://ex.org/1_AstraZeneca> ns1:hasValue 8 ;\n",
    "    ns3:hasName \"AstraZeneca\" .\n",
    "\n",
    "<http://ex.org/1_Female> ns2:hasName \"Female\" ;\n",
    "    ns1:hasValue 2736 .\n",
    "\n",
    "<http://ex.org/1_Janssen> ns1:hasValue 0 ;\n",
    "    ns3:hasName \"Janssen\" .\n",
    "\n",
    "<http://ex.org/1_Male> ns2:hasName \"Male\" ;\n",
    "    ns1:hasValue 1280 .\n",
    "\n",
    "<http://ex.org/1_Moderna> ns1:hasValue 6 ;\n",
    "    ns3:hasName \"Moderna\" .\n",
    "\n",
    "<http://ex.org/1_Pfizer> ns1:hasValue 4002 ;\n",
    "    ns3:hasName \"Pfizer\" .\n",
    "\n",
    "<http://ex.org/2_0to9> ns1:hasFullyCumValue \"0.0\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"0.0\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"0.0\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"2\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"4.17490340317251e-06\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 1 .\n",
    "\n",
    "<http://ex.org/2_10to19> ns1:hasFullyCumValue \"3.0\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"5.42764407681202e-06\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"3.0\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"45\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"8.14146611521803e-05\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 42 .\n",
    "\n",
    "<http://ex.org/2_20to29> ns1:hasFullyCumValue \"12.0\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"1.94043824797831e-05\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"12.0\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"7149\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"0.0115601608623308\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 6399 .\n",
    "\n",
    "<http://ex.org/2_30to39> ns1:hasFullyCumValue \"14.0\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"2.03607636449839e-05\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"14.0\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"11314\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"0.0164544057056677\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 10201 .\n",
    "\n",
    "<http://ex.org/2_40to49> ns1:hasFullyCumValue \"9.0\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"1.147724954091e-05\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"9.0\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"13058\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"0.0166522138339114\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 12052 .\n",
    "\n",
    "<http://ex.org/2_50to59> ns1:hasFullyCumValue \"5.0\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"7.87136303670889e-06\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"5.0\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"10645\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"0.0167581319051532\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 9851 .\n",
    "\n",
    "<http://ex.org/2_60to69> ns1:hasFullyCumValue \"3.0\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"5.90405904059041e-06\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"3.0\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"4539\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"0.0089328413284132\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 4240 .\n",
    "\n",
    "<http://ex.org/2_70to79> ns1:hasFullyCumValue \"3.0\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"8.57360871764534e-06\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"3.0\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"401\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"0.0011460056985919\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 378 .\n",
    "\n",
    "<http://ex.org/2_80> ns1:hasFullyCumValue \"6.0\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"3.27303672347204e-05\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"6.0\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"870\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"0.0047459032490344\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 849 .\n",
    "\n",
    "<http://ex.org/2_AstraZeneca> ns1:hasValue 36 ;\n",
    "    ns3:hasName \"AstraZeneca\" .\n",
    "\n",
    "<http://ex.org/2_Female> ns2:hasName \"Female\" ;\n",
    "    ns1:hasValue 32287 .\n",
    "\n",
    "<http://ex.org/2_Janssen> ns1:hasValue 1 ;\n",
    "    ns3:hasName \"Janssen\" .\n",
    "\n",
    "<http://ex.org/2_Male> ns2:hasName \"Male\" ;\n",
    "    ns1:hasValue 11782 .\n",
    "\n",
    "<http://ex.org/2_Moderna> ns1:hasValue 21 ;\n",
    "    ns3:hasName \"Moderna\" .\n",
    "\n",
    "<http://ex.org/2_Pfizer> ns1:hasValue 44011 ;\n",
    "    ns3:hasName \"Pfizer\" .\n",
    "\n",
    "ns5:Pollagh ns5:hasCityName \"Pollagh\" ;\n",
    "    ns5:hasVaccinationCentre <http://ex.org/vaccinationCentre/-7.6926_53.28823> .\n",
    "\n",
    "<http://ex.org/vaccinationCentre/-7.6926_53.28823> ns4:hasVaccinationRecord ns1:1,\n",
    "        ns1:2 ;\n",
    "    ns4:hasXPoint \"-7.6926\"^^xsd:float ;\n",
    "    ns4:hasYPoint \"53.28823\"^^xsd:float .\n",
    "\n",
    "ns1:1 ns1:extractOn \"2022-10-03\"^^xsd:date ;\n",
    "    ns1:hasAgeGroup <http://ex.org/1_0to9>,\n",
    "        <http://ex.org/1_10to19>,\n",
    "        <http://ex.org/1_20to29>,\n",
    "        <http://ex.org/1_30to39>,\n",
    "        <http://ex.org/1_40to49>,\n",
    "        <http://ex.org/1_50to59>,\n",
    "        <http://ex.org/1_60to69>,\n",
    "        <http://ex.org/1_70to79>,\n",
    "        <http://ex.org/1_80>,\n",
    "        <http://ex.org/1_NA> ;\n",
    "    ns1:hasGender <http://ex.org/1_Female>,\n",
    "        <http://ex.org/1_Male>,\n",
    "        <http://ex.org/1_NA> ;\n",
    "    ns1:hasTotalWeeklyVaccines 4016 ;\n",
    "    ns1:hasVaccine <http://ex.org/1_AstraZeneca>,\n",
    "        <http://ex.org/1_Janssen>,\n",
    "        <http://ex.org/1_Moderna>,\n",
    "        <http://ex.org/1_Pfizer> ;\n",
    "    ns1:recordOn \"2020-W53\" .\n",
    "\n",
    "ns1:2 ns1:extractOn \"2022-10-03\"^^xsd:date ;\n",
    "    ns1:hasAgeGroup <http://ex.org/2_0to9>,\n",
    "        <http://ex.org/2_10to19>,\n",
    "        <http://ex.org/2_20to29>,\n",
    "        <http://ex.org/2_30to39>,\n",
    "        <http://ex.org/2_40to49>,\n",
    "        <http://ex.org/2_50to59>,\n",
    "        <http://ex.org/2_60to69>,\n",
    "        <http://ex.org/2_70to79>,\n",
    "        <http://ex.org/2_80>,\n",
    "        <http://ex.org/2_NA> ;\n",
    "    ns1:hasGender <http://ex.org/2_Female>,\n",
    "        <http://ex.org/2_Male>,\n",
    "        <http://ex.org/2_NA> ;\n",
    "    ns1:hasTotalWeeklyVaccines 44069 ;\n",
    "    ns1:hasVaccine <http://ex.org/2_AstraZeneca>,\n",
    "        <http://ex.org/2_Janssen>,\n",
    "        <http://ex.org/2_Moderna>,\n",
    "        <http://ex.org/2_Pfizer> ;\n",
    "    ns1:recordOn \"2021-W01\" .\n",
    "\n",
    "<http://ex.org/1_NA> ns2:hasName \"NA\" ;\n",
    "    ns1:hasFullyCumValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"0\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 0 ;\n",
    "    ns1:hasValue 0 .\n",
    "\n",
    "<http://ex.org/2_NA> ns2:hasName \"NA\" ;\n",
    "    ns1:hasFullyCumValue \"0.0\"^^xsd:float ;\n",
    "    ns1:hasFullyPerValue \"NaN\"^^xsd:float ;\n",
    "    ns1:hasFullyValue \"0.0\"^^xsd:float ;\n",
    "    ns1:hasParCumValue \"2\"^^xsd:float ;\n",
    "    ns1:hasParPerValue \"INF\"^^xsd:float ;\n",
    "    ns1:hasPartialValue 2 ;\n",
    "    ns1:hasValue 0 ."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "0c983ade",
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "#     SELECT DISTINCT ?g ?v\n",
    "#     WHERE {\n",
    "#         ?a <http://ex.org/vaccinationCentre/hasVaccinationRecord> ?b .\n",
    "#         ?b <http://ex.org/vaccinationRecord/hasAgeGroup> ?g . \n",
    "#         ?g <http://ex.org/vaccinationRecord/hasFullyCumValue> ?v .\n",
    "#         #?g <http://ex.org/vaccine/hasName> ?l .\n",
    "#         FILTER(?b = <http://ex.org/vaccinationRecord/10>)\n",
    "#     }\n",
    "# \"\"\"\n",
    "\n",
    "# res = task4_rdf.query(query)\n",
    "# for row in res:\n",
    "#     print(row.g, row.v)\n",
    "# '''\n",
    "# http://ex.org/10_0to9 2.0\n",
    "# http://ex.org/10_10to19 300.0\n",
    "# http://ex.org/10_20to29 18690.0\n",
    "# http://ex.org/10_30to39 29775.0\n",
    "# http://ex.org/10_40to49 36653.0\n",
    "# http://ex.org/10_50to59 33248.0\n",
    "# http://ex.org/10_60to69 18652.0\n",
    "# http://ex.org/10_70to79 7093.0\n",
    "# http://ex.org/10_80 17301.0\n",
    "# http://ex.org/10_NA 17.0\n",
    "# '''"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dc1d0432",
   "metadata": {},
   "source": [
    "## Merge Knowledge Graphs from Task 3 and Task 4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "3fa1c637",
   "metadata": {},
   "outputs": [],
   "source": [
    "merged_rdf = task3_rdf + task4_rdf"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ef7c50bd",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "\n",
    "Question Answering based on Knowledge Graphs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "e6e81fb1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1. There where 16175 covid cases in Galway on 1st September 2021.\n",
      "2. There where 61959083 of covid cases in the month of September in all counties.\n",
      "3. In week 2021-W27 there were the most vaccinations.\n"
     ]
    }
   ],
   "source": [
    "#Task 5 - Write SPARQL queries or equivalent Python functions that can answer the following questions:\n",
    "\n",
    "# ● How many cases were there in Galway on 1st September 2021?\n",
    "\n",
    "query = \"\"\"\n",
    "    SELECT DISTINCT ?date ?value\n",
    "    WHERE {\n",
    "        ?a <http://ex.org/county/hasCountyName> ?b .\n",
    "        ?a <http://ex.org/county/hasCovidRecord> ?c .\n",
    "        ?c <http://ex.org/covidRecord/recordOn> ?date .\n",
    "        ?c <http://ex.org/covidRecord/hasCovidRecord> ?value . \n",
    "        FILTER(?b = 'Galway' && ?date = \"2021-09-01\"^^xsd:date)\n",
    "    }\n",
    "\"\"\"\n",
    "\n",
    "res = merged_rdf.query(query)\n",
    "for row in res:\n",
    "    print(f\"1. There where {row.value} covid cases in Galway on 1st September 2021.\")\n",
    "    \n",
    "# ● How many cases were there in the month of September in all counties?\n",
    "\n",
    "query = \"\"\"\n",
    "    SELECT DISTINCT ?b ?value\n",
    "    WHERE {\n",
    "        ?a <http://ex.org/county/hasCovidRecord> ?b .\n",
    "        ?b <http://ex.org/covidRecord/recordOn> ?date .\n",
    "        ?b <http://ex.org/covidRecord/hasCovidRecord> ?value . \n",
    "        FILTER(month(?date) = 9)\n",
    "    }\n",
    "\"\"\"\n",
    "\n",
    "res = merged_rdf.query(query)\n",
    "total_covidCases = 0\n",
    "for row in res:\n",
    "    total_covidCases += int(row.value)\n",
    "print(f\"2. There where {total_covidCases} of covid cases in the month of September in all counties.\")\n",
    "\n",
    "# ● In which week were there the most vaccinations?\n",
    "query = \"\"\"\n",
    "    SELECT DISTINCT ?week\n",
    "    WHERE {\n",
    "        ?a <http://ex.org/vaccinationCentre/hasVaccinationRecord> ?b .\n",
    "        ?b <http://ex.org/vaccinationRecord/recordOn> ?week .\n",
    "        ?b <http://ex.org/vaccinationRecord/hasTotalWeeklyVaccines> ?value . \n",
    "    }\n",
    "    ORDER BY DESC(?value)\n",
    "    LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "res = merged_rdf.query(query)\n",
    "for row in res:\n",
    "    print(f\"3. In week {row.week} there were the most vaccinations.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "3c37a08b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Additional. The vaccination centre that has most vaccinations is located in Pollagh, Offaly.\n",
      "          \n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "    SELECT DISTINCT ?countyLabel ?cityLabel ?week ?value\n",
    "    WHERE {\n",
    "        ?county <http://ex.org/county/hasCity> ?city .\n",
    "        ?county <http://ex.org/county/hasCountyName> ?countyLabel .\n",
    "        ?city <http://ex.org/city/hasCityName> ?cityLabel .\n",
    "        \n",
    "        ?city <http://ex.org/city/hasVaccinationCentre> ?a .\n",
    "        \n",
    "        ?a <http://ex.org/vaccinationCentre/hasVaccinationRecord> ?b .\n",
    "        ?b <http://ex.org/vaccinationRecord/recordOn> ?week .\n",
    "        ?b <http://ex.org/vaccinationRecord/hasTotalWeeklyVaccines> ?value . \n",
    "    }\n",
    "    ORDER BY DESC(?value)\n",
    "    LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "res = merged_rdf.query(query)\n",
    "for row in res:\n",
    "#     print(row.countyLabel, row.cityLabel, row.week, row.value)\n",
    "    print(f\"\"\"Additional. The vaccination centre that has most vaccinations is located in {row.cityLabel}, {row.countyLabel}.\n",
    "          \"\"\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
